Submitted by :- 
Name - Omm Tripathi | 
Roll No - 23051606 | 
Section - CSE-35 | 
Lab - 6 |
Assignment- 0.62

In [1]:
import numpy as np
import pandas as pd

-----------------------------------------------------------------------------------

1. Student Marks Analysis

Read the student marks from the student_marks_10.csv file and perform the following:

a) Calculate Total Marks and Average Marks for each student

b) Add a column Result (Pass if Average ≥ 50, otherwise Fail)

Sample Input: student_marks_10.csv

The content of csv file is

Name,Maths,Science,English

Amit,78,85,70

Rina,45,40,50

Suman,60,55,65

Kiran,30,35,25

Rahul,88,90,85

Pooja,92,88,90

Aman,55,58,60

Sneha,67,70,72

Rohit,40,42,45

Neha,73,75,78

Sample Output:

Name Maths Science English Total Average Result

0 Amit 78 85 70 233 77.67 Pass

1 Rina 45 40 50 135 45.00 Fail

2 Suman 60 55 65 180 60.00 Pass

3 Kiran 30 35 25 90 30.00 Fail

4 Rahul 88 90 85 263 87.67 Pass

5 Pooja 92 88 90 270 90.00 Pass

6 Aman 55 58 60 173 57.67 Pass

7 Sneha 67 70 72 209 69.67 Pass

8 Rohit 40 42 45 127 42.33 Fail

9 Neha 73 75 78 226 75.33 Pass

In [3]:
df = pd.read_csv('student_marks_10.csv')
sum = df['Maths']+df['Science'] + df['English']
avg = sum/3
df['Result'] = np.where(avg > 50, 'Pass', 'Fail')
print("sum of each student marks")
# print(sum)
# print("average of each student marks")
# print(avg)

print(df)

sum of each student marks
    Name  Maths  Science  English Result
0   Amit     78       85       70   Pass
1   Rina     45       40       50   Fail
2  Suman     60       55       65   Pass
3  Kiran     30       35       25   Fail
4  Rahul     88       90       85   Pass
5  Pooja     92       88       90   Pass
6   Aman     55       58       60   Pass
7  Sneha     67       70       72   Pass
8  Rohit     40       42       45   Fail
9   Neha     73       75       78   Pass

-----------------------------------------------------------------------------------

2. Employee Salary Increment

Read employee details from the employee_salary_10.csv file and:

a) Increase salary by 10% if experience ≥ 5 years

b) Increase salary by 5% otherwise

c) Add a column New_Salary

Sample Input: employee_salary_10.csv

The content of csv file is

EmpID,Name,Experience,Salary

101,Ravi,6,50000

102,Anita,3,40000

103,Suresh,8,60000

104,Meena,2,35000

105,Kunal,5,45000

106,Priya,1,32000

107,Ajay,10,70000

108,Sunita,4,38000

109,Manoj,7,58000

110,Kavita,3,42000

Sample Output:

EmpID Name Experience Salary New_Salary

0 101 Ravi 6 50000 55000.0

1 102 Anita 3 40000 42000.0

2 103 Suresh 8 60000 66000.0

3 104 Meena 2 35000 36750.0

4 105 Kunal 5 45000 49500.0

5 106 Priya 1 32000 33600.0

6 107 Ajay 10 70000 77000.0

7 108 Sunita 4 38000 39900.0

8 109 Manoj 7 58000 63800.0

9 110 Kavita 3 42000 44100.0

In [16]:
df = pd.read_csv('employee_salary_10.csv')
df['New Salary'] = np.where(df['Experience']>5,df['Salary']+df['Salary']*0.10,df['Salary']+df['Salary']*0.10)
df

   EmpID    Name  Experience  Salary  New Salary
0    101    Ravi           6   50000     55000.0
1    102   Anita           3   40000     44000.0
2    103  Suresh           8   60000     66000.0
3    104   Meena           2   35000     38500.0
4    105   Kunal           5   45000     49500.0
5    106   Priya           1   32000     35200.0
6    107    Ajay          10   70000     77000.0
7    108  Sunita           4   38000     41800.0
8    109   Manoj           7   58000     63800.0
9    110  Kavita           3   42000     46200.0

-----------------------------------------------------------------------------------

3. Sales Data GroupBy Analysis

Read sales data from the sales_data_10.csv file and:

a) Calculate total sales per product

b) Calculate average sales per product

Sample Input: sales_data_10.csv

The content of csv file is

Product,Sales

Pen,100

Pencil,150

Pen,120

Eraser,80

Pencil,170

Pen,130

Marker,200

Eraser,90

Marker,180

Pencil,160

Sample Output:

Product Total_Sales Average_Sales

Eraser 170 85.00

Marker 380 190.00

Pen 350 116.67

Pencil 480 160.00

In [26]:
df = pd.read_csv('sales_data_10.csv')
grp=df.groupby('Product')

sum = grp['Sales'].sum()
avg = grp['Sales'].mean()

result = pd.DataFrame({
    'Total_Sales': sum,
    'Average_Sales': avg
}).reset_index()

print(result)

  Product  Total_Sales  Average_Sales
0  Eraser          170      85.000000
1  Marker          380     190.000000
2     Pen          350     116.666667
3  Pencil          480     160.000000

-----------------------------------------------------------------------------------

4. Handling Missing Values

Read student marks from the missing_marks_10.csv file and:

a) Identify missing values

b) Replace missing values with the mean of the Marks column

Sample Input: missing_marks_10.csv

The content of csv file is

Name,Marks

Rahul,85

Pooja, 80.33

Aman,78

Sneha, 80.33

Rohit,90

Neha,88

Vikas, 80.33

Anjali,72

Karan,69

Isha, 80.33

Sample Output:

Name,Marks

Rahul,85

Pooja, 

Aman,78

Sneha, 

Rohit,90

Neha,88

Vikas, 

Anjali,72

Karan,69

Isha, 

Sample

In [32]:
df = pd.read_csv('missing_marks_10.csv')
df['IsMissing'] = df['Marks'].isna()
df['Replaced Marks'] = np.where(df['IsMissing'],np.mean(df['Marks']),df['Marks'])
print(df)

     Name  Marks  IsMissing  Replaced Marks
0   Rahul   85.0      False       85.000000
1   Pooja    NaN       True       80.333333
2    Aman   78.0      False       78.000000
3   Sneha    NaN       True       80.333333
4   Rohit   90.0      False       90.000000
5    Neha   88.0      False       88.000000
6   Vikas    NaN       True       80.333333
7  Anjali   72.0      False       72.000000
8   Karan   69.0      False       69.000000
9    Isha    NaN       True       80.333333

-----------------------------------------------------------------------------------

5. Attendance Shortage Analysis

Read attendance details from the attendance_10.csv file and:

a) Display students having attendance < 75%

b) Count the total number of such students

Sample Input: attendance_10.csv

The content of csv file is

Name,Attendance

Amit,82

Rina,68

Suman,90

Kiran,70

Rahul,76

Pooja,88

Aman,60

Sneha,95

Rohit,72

Neha,85

Sample Output:

Name Attendance

1 Rina 68

3 Kiran 70

6 Aman 60

8 Rohit 72
Total students with attendance < 75% : 4

In [41]:
df  = pd.read_csv('attendance_10.csv')
newdf = df['Attendance']<75
lowattd = df[newdf].shape[0]
print(df[newdf])
print("total number of such students are:",lowattd)

    Name  Attendance
1   Rina          68
3  Kiran          70
6   Aman          60
8  Rohit          72
total number of such students are: 4